# SetMaterialFillStyle

## Description
```pascal
FUNCTION SetMaterialFillStyle(
				materialHandle : HANDLE;
				fillStyle      : LONGINT) : BOOLEAN;
```

```python

def vs.SetMaterialFillStyle(materialHandle, fillStyle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle|HANDLE||
|fillStyle|LONGINT|InternalIndex of fillStyle|

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes